In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('./01.data.xlsx', dtype={'Instore':str})

默认情况下，pandas并不会自动检索出有效数据范围

In [3]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,ID,Name,Instore,Date
3,NaN,NaN,NaN,NaN,Book_1,NaN,NaN
4,NaN,NaN,NaN,NaN,Book_2,NaN,NaN

**加载数据表范围**

In [4]:
df=pd.read_excel('./01.data.xlsx', header=3, usecols='D:G', dtype={'Instore':str})
df.head()

   ID    Name Instore  Date
0 NaN  Book_1     NaN   NaN
1 NaN  Book_2     NaN   NaN
2 NaN  Book_3     NaN   NaN
3 NaN  Book_4     NaN   NaN
4 NaN  Book_5     NaN   NaN

In [5]:
df=pd.read_excel('./01.data.xlsx', skiprows=3, usecols='D:G', dtype={'Instore':str})
df.head()

   ID    Name Instore  Date
0 NaN  Book_1     NaN   NaN
1 NaN  Book_2     NaN   NaN
2 NaN  Book_3     NaN   NaN
3 NaN  Book_4     NaN   NaN
4 NaN  Book_5     NaN   NaN

**填充ID列-像excel中的自动填充一样**

In [6]:
# check the data type of the ID column
df.ID.dtype

dtype('float64')

使用 `at` 来访问单个值或者标签对，可以用在DataFrame或者Series上

In [7]:
# locate a scalar data
df.at[3,'Name']

'Book_4'

In [8]:
# 填充值
for i in df.index:
    df.ID.at[i]=i
    
# 或者使用列表推导
df.ID = [i for i in df.index]
    
df.ID

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
Name: ID, dtype: int64

In [9]:
# 转换ID列的类型， 从float变为int
df.ID.astype('int')

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
Name: ID, dtype: int64

In [10]:
df.dtypes

ID           int64
Name        object
Instore     object
Date       float64
dtype: object

In [11]:
# 改变原来的ID列的数据类型
df = df.assign(ID=df.ID.astype('int'))
df.dtypes

ID           int64
Name        object
Instore     object
Date       float64
dtype: object

**填充日期**

In [12]:
from datetime import date, timedelta

# 定义一个方法来实现按月累加，模拟excel中的日期自动填充.
def add_month(date_, month_delta):
    year_delta = (date_.month + month_delta) // 12
    new_month = (date_.month + month_delta) % 12 + 1
    new_year = date_.year + year_delta
    
    return date(new_year, new_month, date_.day)
    

date_start = date(2021,2,14)
# df.Date = [date_start + timedelta(days=i) for i in df.index]
# df.Date = [date(date_start.year+i,date_start.month, date_start.day) for i in df.index]
df.Date = [add_month(date_start, -i) for i in df.index]

for i in df.index:
    df.Instore.at[i]='Yes' if i % 2 == 0 else 'No'
df

    ID     Name Instore        Date
0    0   Book_1     Yes  2021-03-14
1    1   Book_2      No  2021-02-14
2    2   Book_3     Yes  2021-01-14
3    3   Book_4      No  2020-12-14
4    4   Book_5     Yes  2020-11-14
5    5   Book_6      No  2020-10-14
6    6   Book_7     Yes  2020-09-14
7    7   Book_8      No  2020-08-14
8    8   Book_9     Yes  2020-07-14
9    9  Book_10      No  2020-06-14
10  10  Book_11     Yes  2020-05-14
11  11  Book_12      No  2020-04-14
12  12  Book_13     Yes  2020-03-14
13  13  Book_14      No  2020-02-14
14  14  Book_15     Yes  2020-01-14
15  15  Book_16      No  2019-12-14
16  16  Book_17     Yes  2019-11-14